/*******************************************************************************/
/**
 * @file SceneBase.h.
 * 
 * @brief シーン基底クラス定義.
 *
 * @date 2008/11/27.
 *
 * @version 1.00.
 *
 * @author Kenji Iwata.
 */
/*******************************************************************************/
#ifndef _SCENE_BASE_H_
#define _SCENE_BASE_H_

/*===== インクルード ==========================================================*/
#include	"Manager/Object/ObjectManager.h"

/**
 * @brief SceneBase．
 */
class SceneBase
{
public:

	/*=========================================================================*/
	/**
	 * @brief 仮想デストラクタ.
	 *
	 */
	virtual ~SceneBase(){}

	/*=========================================================================*/
	/**
	 * @brief 初期化処理.
	 * 
	 */
	virtual void Initialize() = 0;
	/*=========================================================================*/
	/**
	 * @brief 終了処理.
	 * 
	 */
	virtual void Terminate() = 0;
	/*=========================================================================*/
	/**
	 * @brief 終了しているかどうか.
	 * 
	 * @return 終了フラグ.
	 */
	virtual bool IsTerminated() = 0;

	/*=========================================================================*/
	/**
	 * @brief シーンの描画処理.
	 * 
	 */
	virtual void RenderScene() = 0;
	/*=========================================================================*/
	/**
	 * @brief シーンの更新処理.
	 * 
	 * @param[in] frameTimer 更新タイマ.
	 */
	virtual void UpdateScene(float frameTimer) = 0;

protected:

	/** オブジェクトマネージャ */
	ObjectManager* m_objectManager;

};

#endif

/*===== EOF ===================================================================*/