/*******************************************************************************/
/*
 * @file TitleSceneState.cpp.
 * 
 * @brief　タイトルシーン状態クラス定義.
 *
 * @date 2008/12/27.
 *
 * @version 1.00.
 *
 * @author Jun Futagawa.
 */
/*******************************************************************************/

/*===== インクルード ==========================================================*/
#include	"Scene/TitleSceneState.h"


/*=============================================================================*/
/**
 * @brief コンストラクタ.
 * 
 */
TitleSceneState::TitleSceneState(ObjectManager& objectManager) :
	m_objectManager(objectManager)
{
}

/*=============================================================================*/
/**
 * @brief デストラクタ.
 *
 */
TitleSceneState::~TitleSceneState()
{

}


/*===== EOF ===================================================================*/