/*******************************************************************************/
/*
 * @file ObjectParam.cpp.
 * 
 * @brief オブジェクトパラメータークラス定義.
 *
 * @date 2008/12/04.
 *
 * @version 1.00.
 *
 * @author Kenji Iwata.
 */
/*******************************************************************************/

/*===== インクルード ==========================================================*/
#include "Object/ObjectParam.h"


/*=============================================================================*/
/**
 * @brief コンストラクタ.
 * 
 */
ObjectParam::ObjectParam()
{
}

/*=============================================================================*/
/**
 * @brief デストラクタ.
 *
 */
ObjectParam::~ObjectParam()
{

}

/*=============================================================================*/
/**
 * @brief 位置の設定.
 * 
 * @param[in] x x位置.
 * @param[in] y y位置.
 */
void ObjectParam::SetPosition(float x, float y)
{

}

/*=============================================================================*/
/**
 * @brief 位置の設定.
 * 
 * @param[in] position 位置.
 */
void ObjectParam::SetPosition(Vector2 position)
{

}

/*=============================================================================*/
/**
 * @brief 位置の取得.
 * 
 * @return 位置.
 */
Vector2 ObjectParam::GetPosition()
{
	return 0;
}

/*=============================================================================*/
/**
 * @brief サイズの設定.
 * 
 * @param[in] sx xサイズ.
 * @param[in] sy yサイズ.
 */
void ObjectParam::SetSize(float sx, float sy)
{

}

/*=============================================================================*/
/**
 * @brief サイズの設定.
 * 
 * @param[in] size サイズ.
 */
void ObjectParam::SetSize(Vector2 size)
{

}

/*=============================================================================*/
/**
 * @brief サイズの取得.
 * 
 * @return サイズ.
 */
Vector2 ObjectParam::GetSize()
{
	return 0;
}

/*=============================================================================*/
/**
 * @brief テクスチャIDの設定.
 * 
 * @param[in] texture テクスチャID.
 */
void ObjectParam::SetTextureID(int texture)
{

}

/*=============================================================================*/
/**
 * @brief テクスチャIDの取得.
 * 
 * @return テクスチャID.
 */
int ObjectParam::GetTextureID()
{
	return 0;
}

/*===== EOF ===================================================================*/