/*******************************************************************************/
/**
 * @file IFrameWork.h.
 * 
 * @brief フレームワークインターフェース定義.
 *
 * @date 2008/06/28.
 * 
 * @version 1.00.
 * 
 * @author Kentarou Nishimura.
 */
/******************************************************************************/
#ifndef _NGL_IFRAMEWORK_H_
#define _NGL_IFRAMEWORK_H_

#include	"FrameWorkDesc.h"

namespace Ngl{


/**
 * @interface IFrameWork．
 * @brief フレームワークインターフェース
 */
class IFrameWork
{

public:

	/*=========================================================================*/
	/**
	 * @brief デストラクタ
	 * 
	 * @param[in] なし.
	 */
	virtual ~IFrameWork(){}


	/*=========================================================================*/
	/**
	 * @brief アプリケーションの実行
	 * 
	 * @param[in] なし.
	 * @return 終了コード.
	 */
	virtual int run() = 0;

	
	/*=========================================================================*/
	/**
	 * @brief アプリケーションの終了
	 * 
	 * @param[in] なし.
	 * @return なし.
	 */
	virtual void exit() = 0;
	
	
	/*=========================================================================*/
	/**
	 * @brief フレームワーク記述子を取得
	 * 
	 * @param[in] なし.
	 * @return フレームワーク記述子.
	 */
	virtual const FrameWorkDesc& desc() const = 0;


	/*=========================================================================*/
	/**
	 * @brief ウィンドウハンドルを取得する
	 * 
	 * @param[in] なし.
	 * @return ウィンドウハンドル.
	 */
	virtual void* getHWND() = 0;

};

}	// namespace Ngl

#endif

/*===== EOF ==================================================================*/