/*******************************************************************************/
/**
 * @file ObjectParam.h.
 * 
 * @brief オブジェクトパラメータクラス定義.
 *
 * @date 2008/12/04.
 *
 * @version 1.00.
 *
 * @author Kenji Iwata.
 */
/*******************************************************************************/
#ifndef _OBJECT_PARAM_H_
#define _OBJECT_PARAM_H_

#include "IGameDevice.h"

/**
 * @brief ObjectParam．
 */

class ObjectParam
{
public:

	/*=========================================================================*/
	/**
	 * @brief コンストラクタ.
	 *
	 */
	ObjectParam();
	/*=========================================================================*/
	/**
	 * @brief デストラクタ.
	 *
	 */
	~ObjectParam();

	/*=========================================================================*/
	/**
	 * @brief 位置の設定.
	 * 
	 * @param[in] x x位置.
	 * @param[in] y y位置.
	 */
	void SetPosition(float x, float y);
	/*=========================================================================*/
	/**
	 * @brief 位置の設定.
	 * 
	 * @param[in] position 位置.
	 */
	void SetPosition(Vector2 position);
	/*=========================================================================*/
	/**
	 * @brief 位置の取得.
	 * 
	 * @return 位置.
	 */
	Vector2 GetPosition();

	/*=========================================================================*/
	/**
	 * @brief サイズの設定.
	 * 
	 * @param[in] sx xサイズ.
	 * @param[in] sy yサイズ.
	 */
	void SetSize(float sx, float sy);
	/*=========================================================================*/
	/**
	 * @brief サイズの設定.
	 * 
	 * @param[in] size サイズ.
	 */
	void SetSize(Vector2 size);
	/*=========================================================================*/
	/**
	 * @brief サイズの取得.
	 * 
	 * @return サイズ.
	 */
	Vector2 GetSize();

	/*=========================================================================*/
	/**
	 * @brief テクスチャIDの設定.
	 * 
	 * @param[in] texture テクスチャID.
	 */
	void SetTextureID(int texture);
	/*=========================================================================*/
	/**
	 * @brief テクスチャIDの取得.
	 * 
	 * @return テクスチャID.
	 */
	int GetTextureID();

private:

	/** 位置 */
	Vector2 m_position;
	/** サイズ */
	Vector2 m_size;
	/** テクスチャID */
	int m_textureID;

};

#endif

/*===== EOF ===================================================================*/